In [6]:
import numpy as np
import pandas as pd

In [7]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [8]:
df = pd.DataFrame(d)

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
# drop missing values
df.dropna() # dropna takes axis argument, default=0,

     A    B  C
0  1.0  5.0  1

In [12]:
# drop missing values
df.dropna(axis=1) # axis=1 drops columns with NaNs

   C
0  1
1  2
2  3

In [13]:
# threshold argument specifies to drop rows with NaNs above a certain number
# thresh=2 drops rows with NaNs >= 2 
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
# replacing missing values / filling NaN
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [15]:
# filling a column with the mean
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64